In [2]:
import pandas as pd
from pandas import *
s1 = Series([0, 1, 2, 3], index=['a', 'b', 'c', 'd'])
s2 = Series([4, 5, 6], index=['c', 'd', 'e'])
data2 = pd.concat([s1, s2], keys=['one', 'two'])
print data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [4]:
data2.unstack()

      a   b  c  d   e
one   0   1  2  3 NaN
two NaN NaN  4  5   6

In [5]:
data2.unstack().stack()

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: float64

In [6]:
data = DataFrame(np.arange(6).reshape((2, 3)), 
                 index=pd.Index(['Ohio', 'Colorado'], name='state'), 
                 columns=pd.Index(['one', 'two', 'three'], name='number'))
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [7]:
result = data.stack()
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [9]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [6]:
### Changing long format to wide format
### Create a long format data set
import pandas as pd
from pandas import *
data={'type':['P1','P1','P2','P2','P3','P3'],
      'color':['Red','Blue','Red','Blue','Red','Blue'],
      'price':[100,120,140,90,110,105]}
data=DataFrame(data,columns=['type','color','price'])
data

  type color  price
0   P1   Red    100
1   P1  Blue    120
2   P2   Red    140
3   P2  Blue     90
4   P3   Red    110
5   P3  Blue    105

In [7]:
### Type and Price are used as row and column index
### Price is used to fill the table
pivoted = data.pivot('type','color')
pivoted

      price
color  Blue  Red
type
P1      120  100
P2       90  140
P3      105  110

In [8]:
### Adding another column of price2
data['price2'] = [85,95,130,100,110,125]
data

  type color  price  price2
0   P1   Red    100      85
1   P1  Blue    120      95
2   P2   Red    140     130
3   P2  Blue     90     100
4   P3   Red    110     110
5   P3  Blue    105     125

In [9]:
### Type and Color are used as row and column index
### price and price2 are used to fill the table
pivoted=data.pivot('type','color')
pivoted

      price      price2
color  Blue  Red   Blue  Red
type
P1      120  100     95   85
P2       90  140    100  130
P3      105  110    125  110